"""
接口排序
需要排序的列表:

port_list = ['eth 1/101/1/42','eth 1/101/1/26','eth 1/101/1/23','eth 1/101/1/7','eth 1/101/2/46','eth 1/101/1/34','eth 1/101/1/18','eth 1/101/1/13','eth 1/101/1/32','eth 1/101/1/25','eth 1/101/1/45','eth 1/101/2/8']
需要排序的结果（按接口编号数值从小到大）:

['eth 1/101/1/7', 'eth 1/101/1/13', 'eth 1/101/1/18', 'eth 1/101/1/23', 'eth 1/101/1/25', 'eth 1/101/1/26', 'eth 1/101/1/32', 'eth 1/101/1/34', 'eth 1/101/1/42', 'eth 1/101/1/45', 'eth 1/101/2/8', 'eth 1/101/2/46']
作业提示: Google 搜索 "python sort lambda"

注意: 一句话就能解决
"""


port_list = ['eth 1/101/1/42','eth 1/101/1/26','eth 1/101/1/23','eth 1/101/1/7','eth 1/101/2/46','eth 1/101/1/34','eth 1/101/1/18','eth 1/101/1/13','eth 1/101/1/32','eth 1/101/1/25','eth 1/101/1/45','eth 1/101/2/8']

print(sorted(port_list, key=lambda x: (int(x.split('/')[-2]), int(x.split('/')[-1]))))


