"""
打印一张简单的IP地址规划表
假设你负责一个小型网络，有3台设备，请定义变量并打印如下格式的IP规划表:

========== IP地址规划表 ==========
设备名称          管理地址          角色
-----------------------------------------
CoreSwitch        10.1.1.1          核心交换机
Firewall          10.1.1.2          防火墙
WLC               10.1.1.3          无线控制器
=========================================
提示: 可以直接用多个print语句，也可以尝试用 \t (Tab) 来对齐。
"""



devices = [{"name": "CoreSwitch", "ip": "10.1.1.1", "role": "核心交换机"},
 {"name": "Firewall", "ip": "10.1.1.2", "role": "防火墙"},
 {"name": "WLC", "ip": "10.1.1.3", "role": "无线控制器"},]

print('='*10+ 'IP地址规划表' + '='*10)
print(f"{'设备名称':<14} {'管理地址':<12} {'角色':<10}")
print("-" * 40)

for dev in devices:
    print(f"{dev['name']:<14} {dev['ip']:<12} {dev['role']:<10}")

print("="*40)